Autodesk.Revit.UI.UIFabricationUtils.SetRestrictServiceGroupForSwapOut(Autodesk.Revit.DB.Document,System.Boolean)
Sets the restrict service group state for service swap out.
document:
The document.
restrictGroup:
The restrict service group state, when enabled the service swap out will only use the assigned group index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.ExportFabricationData(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
file:
full path, as returned by getFabricationExports
partIds:
the parts that will be exported.
Returns:
whether the export was successful
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationExports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
shows modal UI to setup all fabrication exports of the specified type.
partIds:
used if user clicks 'export now'
Returns:
returns whether the user completed the UI successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.GetFabricationExports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType)
Returns:
dictionary of path / description pairs, where path is the unique key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PlaceFabricationPart(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.FabricationItemFile)
Call to place a fabrication part from an item file.
doc:
The document.
serviceId:
The service Id to associate with the item file.
itemFile:
The item file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016